soap-sample-requests/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getMissionRequest>
         <gs:id>1254</gs:id>
      </gs:getMissionRequest>
   </soapenv:Body>
</soapenv:Envelope>